app/views/categories/index.html.erb

            <p class="card-text text-muted"><%= category.description %></p>
            <p class="small fw-bold text-primary"><%= category.events.count %> Upcoming Events</p>
---
SELECT COUNT(*) FROM "events" WHERE "events"."category_id" = 10