app/views/categories/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."category_id" = 10
SELECT 1 AS one FROM "events" WHERE "events"."category_id" = 10 LIMIT 1
---
  <div class="row">
    <% if @category.events.any? %>
      <% @category.events.each do |event| %>